IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIOCOBOL09.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1      PIC 9(1) VALUE 7.
01 NUM2      PIC 9(1) VALUE 7.
01 RESULTADO PIC 9(2).

PROCEDURE DIVISION.

MULTIPLY NUM1 BY NUM2 GIVING RESULTADO.
DISPLAY 'O QUADRADO DE 7 É ' RESULTADO

STOP RUN.

