IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIOPRATIQUECOBOL06.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1     PIC 9(2) VALUE 7.

PROCEDURE DIVISION.

IF NUM1 / 2 = 0
   DISPLAY ' O NUMERO É PAR'
   ELSE
   DISPLAY ' O NUMERO É IMPAR'
   
STOP RUN.

