IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIOCOBOL08.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N         PIC 9(2) VALUE 1.
01 RESULTADO PIC 9(2).

PROCEDURE DIVISION.
PERFORM UNTIL N > 5

COMPUTE RESULTADO = N * 3
DISPLAY ' RESULTADO: ' RESULTADO

ADD 1 TO N

END-PERFORM.

STOP RUN.

