IDENTIFICATION DIVISION.
PROGRAM-ID. PROG2.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NOME PIC A(020).

01 DATA-ATUAL.
    05 ANO-ATUAL PIC 9(004).
    05 MES-ATUAL PIC 9(002).
    05 DIA-ATUAL PIC 9(002).
   
PROCEDURE DIVISION.
    DISPLAY "ENTRE COM SEU NOME: ".
    ACCEPT NOME.
    ACCEPT DATA-ATUAL FROM DATE YYYYMMDD.
    
    DISPLAY "Bem vindo " NOME.
    DISPLAY "Sabia que hoje é "  DIA-ATUAL "/" MES-ATUAL "/" ANO-ATUAL
    
STOP RUN.
END PROGRAM PROG2.

    
