IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIO04.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1        PIC 9(2) VALUE 10.
01 NUM2        PIC 9(2) VALUE 20.
01 RESULTADO   PIC 9(2).

PROCEDURE DIVISION.
  
    ADD NUM1 TO NUM2 GIVING RESULTADO.
    DISPLAY 'O TOTAL É ' RESULTADO.
    
STOP RUN.
      
