IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIO02.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1    PIC 9(2) VALUE 25.
01 NUM2    PIC 9(2) VALUE 30.
01 RESULTADO       PIC 9(2).

PROCEDURE DIVISION.
    COMPUTE RESULTADO = NUM1 + NUM2.
    DISPLAY 'A SOMA É ' RESULTADO.

STOP RUN.
      
