IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIOCOBOL07.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM1       PIC 9(2) VALUE 20.
01 NUM2       PIC 9(2) VALUE 40.
01 NUM3       PIC 9(2) VALUE 60.
01 RESULTADO  PIC 9(2).

PROCEDURE DIVISION.

COMPUTE RESULTADO = (NUM1 + NUM2 + NUM3) / 3.
DISPLAY 'A MEDIA É:' RESULTADO.

STOP RUN.

