IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIOPRATIQUECOBOL03.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM1        PIC 9(2) VALUE 5.
01 NUM2        PIC 9(2) VALUE 12.
01 RESULTADO   PIC 9(2).

PROCEDURE DIVISION.
   MULTIPLY NUM1 BY NUM2 GIVING RESULTADO
   DISPLAY ' O PRODUTO É '  RESULTADO.
   
STOP RUN.
