IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIO05.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 F          PIC 9(3) VALUE 100.
    01 CELSIUS    PIC 9(2)V99.
PROCEDURE DIVISION.

    COMPUTE CELSIUS = (F - 32) * 5/9.
    DISPLAY 'TEMPERATURA EM CELSIUS: ' CELSIUS.

STOP RUN.
