IDENTIFICATION DIVISION.
PROGRAM-ID. PROGIMC.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 ALTURA    PIC 9V99.
01 PESO      PIC 999.
01 IMC_TOTAL PIC ZZ9.99.
   
PROCEDURE DIVISION.
    DISPLAY "ENTRE COM SUA ALTURA EM (Mt): ".
    ACCEPT ALTURA.
    DISPLAY "ENTRE COM O SEU PESO (EM Kg): ".
    ACCEPT PESO.
    
    COMPUTE IMC_TOTAL = PESO / (ALTURA ** 2).
    DISPLAY "SEU IMC É: " IMC_TOTAL.
    
STOP RUN.
END PROGRAM PROGIMC.
