IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIO01.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
    DISPLAY 'OLÁ, MUNDO.'
    
STOP RUN.
