IDENTIFICATION DIVISION.
PROGRAM-ID. DESAFIO11.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
   DECIMAL-POINT IS COMMA.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC      9(1) VALUE 5.
01 NUM2 PIC      9(2) VALUE 10.
01 NUM3 PIC      9(2) VALUE 15.
01 NUM4 PIC      9(2) VALUE 20.
01 RESULTADO PIC 9(2)V9.

PROCEDURE DIVISION.

COMPUTE RESULTADO = (NUM1 + NUM2 + NUM3 + NUM4) / 4.
DISPLAY 'A MEDIA É:'RESULTADO

STOP RUN.

